/*
1) Написати на језику C++ следеће класе (класе опремити оним конструкторима и деструктором
који су потребни за безбедно и ефикасно коришћење класа у општем случају):
• Пилот има име, број сати летења и информацију да ли је тренутно на неком лету
(подразумевано није). Подаци пилота се задају при стварању. Може да се дохвати име, број
сати летења и информација да ли је пилот тренутно на неком лету. Пилоту је могуће
повећати број сати летења за задати број сати. Могуће је променити информацију о томе да
ли је пилот на неком лету или није. Није могуће копирати пилота ни на који начин. На
главном излазу се исписује у облику име(број_сати_летења)-стање, где стање може бити
L (лети), или N (не лети) у зависности да ли се тренутно налази на лету или не.
• Авион има назив, капетана, копилота и максималан број путника које може да прими. Сви
подаци авиона могу да се дохвате. Приликом стварања задаје се назив и максималан број
путника које авион може да прими. Авиону може да се постави капетан и копилот. Капетан
авиона може бити само пилот који мора имати најмање 100 сати летења, у супротном не
може да се постави за капетана авиона. Копилот авиона може бити било који пилот.
Приликом постављања капетана и копилота, мора им се поставити информација да су на
лету. Није могуће копирати авион ни на који начин. На главном излазу се исписује у облику
AVION:назив - максималан_број_путника.
• Флота авиона има назив и садржи произвољан број авиона. Ствара се са задатим именом, а
авиони се накнадно додају. Може да се одреди укупан број авиона у флоти и максималан број
путника који флота може да превезе. Такође, могуће је дохватити авион који може да прими
највећи број путника. Флота се исписује на главном излазу тако што се у првом реду испише
назив флоте, а у засебним редовима сви авиони који се налазе у њој.
Написати главну функцију која направи флоту авиона, неколико пилота и авиона. Затим
постави капетане и копилоте авионима и дода их у флоту. На крају испише флоту и авион са
највећим бројем путника из флоте.
*/
#include "pilot.h"
#include <iostream>
#include "avion.h"
#include "flota.h"
using namespace std;

int main() {
	Flota* f = new Flota("Air Serbia");
	Pilot* p = new Pilot("Mirko", 20);
	Pilot* p2 = new Pilot("Darko", 200);
	Pilot* p3 = new Pilot("Lana", 11);
	Pilot* p4 = new Pilot("Ana", 348);
	Pilot* p5 = new Pilot("Marko", 24);
	Pilot* p6 = new Pilot("Janko", 100);
	Pilot* p7 = new Pilot("Ogi", 12);
	Pilot* p8 = new Pilot("Anastasija", 1099);
	Avion* a = new Avion("Airbus A320", 180);
	Avion* a2 = new Avion("Boeing 777", 388);
	Avion *a3 = new Avion("Embraer 195", 132);
	Avion* a4 = new Avion("Airbus A380", 853);
	a->postaviKapetana(*p2);
	a->postaviKopilota(*p);
	a2->postaviKapetana(*p4);
	a2->postaviKopilota(*p3);
	a3->postaviKapetana(*p6);
	a3->postaviKopilota(*p5);
	a4->postaviKapetana(*p8);
	a4->postaviKopilota(*p7);
	f->dodajAvion(*a);
	f->dodajAvion(*a2);
	f->dodajAvion(*a3);
	f->dodajAvion(*a4);
	f->ispisiFlotu();
	cout << endl;
	f->najveciAvion()->ispisiAvion();
}
